package com.gosinventarytet.debagovich.game.utils

import com.gosinventarytet.debagovich.game.data.DataQuiz

const val WIDTH_UI  = 793f
const val HEIGHT_UI = 1722f

const val TIME_ANIM_SCREEN = 0.150f

val GLOBAL_listQuiz_01 = listOf(
    DataQuiz(
        "Как государственные инвестиции влияют на развитие спорта в России?",
        listOf(
            "Строительство спортивных объектов",
            "Банкеты",
            "Турагентства",
            "Кафе и рестораны",
        )
    ),
    DataQuiz(
        "Как государственные инвестиции способствуют развитию научных исследований в России?",
        listOf(
            "Автосервисы",
            "Коммерческая недвижимость",
            "Финансирование исследований",
            "Юридические услуги",
        )
    ),
    DataQuiz(
        "Каким образом государственные инвестиции влияют на здравоохранение в России?",
        listOf(
            "Туристические агентства",
            "Кинотеатры",
            "Строительство больниц",
            "Спортивные клубы",
        )
    ),
    DataQuiz(
        "Как государственные инвестиции способствуют развитию системы образования в России?",
        listOf(
            "Ремонт дорог",
            "Покупка жилья",
            "Финансирование школ",
            "Зарубежные стажировки",
        )
    ),
    DataQuiz(
        "Какой пример использования государственных инвестиций в России можно привести?",
        listOf(
            "Импорт продуктов",
            "Банковские счета",
            "Развитие железнодорожной сети",
            "Частные компании",
        )
    ),
    DataQuiz(
        "Кто отвечает за контроль и управление государственными инвестициями в России?",
        listOf(
            "Бизнесмены",
            "Мировой банк",
            "Правительство РФ",
            "Частные лица",
        )
    ),
    DataQuiz(
        "В каких инфраструктурных проектах в России чаще всего используются государственные инвестиции?",
        listOf(
            "Выплата пенсий",
            "Экспорт нефти",
            "Строительство дорог",
            "Покупка акций",
        )
    ),
    DataQuiz(
        "Какова основная цель государственных инвестиций в экономику страны?",
        listOf(
            "Импорт товаров",
            "Сокращение долгов",
            "Экономический рост и развитие",
            "Личный доход",
        )
    ),
    DataQuiz(
        "В какие сферы чаще всего направляются государственные инвестиции в России?",
        listOf(
            "Заграничные счета",
            "Образование",
            "Социальная сфера",
            "Бизнес",
        )
    ),
    DataQuiz(
        "Что такое государственные инвестиции и какая их основная цель?",
        listOf(
            "Заграничный капитал",
            "Личные сбережения",
            "Вложения государства",
            "Банковский вклад",
        )
    ),
)
val GLOBAL_listQuiz_02 = listOf(
    DataQuiz(
        "Каковы перспективы государственных инвестиций в России в ближайшем будущем?",
        listOf(
            "Импорт технологий",
            "Личный доход",
            "Экономическое развитие",
            "Сокращение расходов",
        )
    ),
    DataQuiz(
        "Какую роль играет частный сектор в использовании государственных инвестиций в России?",
        listOf(
            "Личные инвестиции",
            "Банковские кредиты",
            "Партнерства",
            "Зарубежные поездки",
        )
    ),
    DataQuiz(
        "Какие государственные программы направлены на использование государственных инвестиций в России?",
        listOf(
            "Коммерческая аренда",
            "Личные накопления",
            "Национальные проекты",
            "Зарубежные командировки",
        )
    ),
    DataQuiz(
        "Как государственные инвестиции влияют на рынок труда в России?",
        listOf(
            "Экспорт рабочей силы",
            "Личные доходы",
            "Создание рабочих мест",
            "Сокращение вакансий",
        )
    ),
    DataQuiz(
        "Каким образом государственные инвестиции поддерживают малый бизнес в России?",
        listOf(
            "Строительство дорог",
            "Личные вклады",
            "Выделение кредитов и субсидий",
            "Заграничные стажировки",
        )
    ),
    DataQuiz(
        "Какие отрасли считаются приоритетными для государственных инвестиций в России в настоящее время?",
        listOf(
            "Гостиницы и туризм",
            "Импорт товаров",
            "IT и инновации",
            "Кинотеатры",
        )
    ),
    DataQuiz(
        "Как государственные инвестиции влияют на общее экономическое развитие России?",
        listOf(
            "Ремонт дорог",
            "Сокращение рабочих мест",
            "Стимулируют рост и развитие",
            "Личный доход",
        )
    ),
    DataQuiz(
        "Какие меры могут помочь решить проблемы, связанные с государственными инвестициями в России?",
        listOf(
            "Снижение налогов",
            "Импорт технологий",
            "Прозрачность",
            "Сокращение расходов",
        )
    ),
    DataQuiz(
        "Какие основные препятствия стоят на пути эффективного использования государственных инвестиций в России?",
        listOf(
            "Импорт товаров",
            "Экономический рост",
            "Коррупция",
            "Недостаток средств",
        )
    ),
    DataQuiz(
        "Какие новые направления государственных инвестиций стали актуальными в последние годы в России?\n",
        listOf(
            "Школьное образование",
            "Коммерческая недвижимость",
            "Технологии и инновации",
            "Заграничные поездки",
        )
    ),
)
val GLOBAL_listQuiz_03 = listOf(
    DataQuiz(
        "Каким образом увеличение государственных инвестиций влияет на экономику России?",
        listOf(
            "Импорт товаров",
            "Экономия",
            "Стимулирует экономический рост",
            "Сокращение налогов",
        )
    ),
    DataQuiz(
        "Как распределяются средства государственных инвестиций между различными проектами?",
        listOf(
            "Личные счета",
            "Дача взяток",
            "Национальные проекты",
            "Заграничные поездки",
        )
    ),
    DataQuiz(
        "Какова структура распределения государственных инвестиций в России?",
        listOf(
            "Мода",
            "Туризм",
            "Промышленность",
            "Личные расходы",
        )
    ),
    DataQuiz(
        "Откуда правительство России получает средства для государственных инвестиций?",
        listOf(
            "Зарубежные кредиты",
            "Экспорт нефти",
            "Налоговые поступления",
            "Личные сбережения",
        )
    ),
    DataQuiz(
        "Какие отрасли являются основными получателями государственных инвестиций в России?",
        listOf(
            "Рестораны",
            "Гостиницы",
            "Энергетика и транспорт",
            "Образование",
        )
    ),
    DataQuiz(
        "В какие регионы России чаще всего направляются государственные инвестиции?",
        listOf(
            "Коммерческие банки",
            "Зарубежные страны",
            "Москва",
            "Загородные поселки",
        )
    ),
    DataQuiz(
        "Каков общий объем государственных инвестиций в экономику России в денежном выражении?",
        listOf(
            "Миллионы тонн",
            "Тонны нефти",
            "Триллионы рублей",
            "Миллионы долларов",
        )
    ),
    DataQuiz(
        "Какой процент ВВП России составляют государственные инвестиции в настоящее время?",
        listOf(
            "15%",
            "5%",
            "Около 20%",
            "10%",
        )
    ),
    DataQuiz(
        "Кто стал основателем системы государственных инвестиций в России?",
        listOf(
            "Международные организации",
            "Банкиры",
            "Правительство",
            "Бизнесмены",
        )
    ),
    DataQuiz(
        "Когда впервые в России начали активно использовать государственные инвестиции для развития экономики?",
        listOf(
            "18 век",
            "19 век",
            "В 20 веке",
            "21 век",
        )
    ),

)