package com.finansoviy.gurochek.game.utils

import com.finansoviy.gurochek.game.data.DataQuiz

const val WIDTH_UI  = 1000f
const val HEIGHT_UI = 2167f

const val TIME_ANIM_SCREEN = 0.325f

val GLOBAL_listDataQuiz = listOf(
    DataQuiz(
        title = "Финансовая навигация",
        time = 5,
        listQ = listOf(
            "Что такое финансовая грамотность?",
            "Что означает термин \"диверсификация\"?",
            "Какая часть дохода должна откладываться в накопления?",
            "Какой инструмент НЕ помогает в планировании бюджета?",
            "Что такое \"инфляция\"?",
            "Как называется фонд на случай непредвиденных расходов?",
            "Какой из этих активов считается наименее рискованным?",
            "Что происходит при дефолте?",
            "Какой из этих банковских продуктов предназначен для краткосрочного хранения денег?",
            "Как можно увеличить свой доход?"
        ),
        listA = listOf(
            listOf(
                "Способность эффективно управлять финансами",
                "Умение быстро зарабатывать деньги",
                "Владение несколькими банковскими картами",
                "Открытие собственного бизнеса",
            ),
            listOf(
                "Разделение рисков путем инвестирования в разные активы",
                "Вложение всех денег в один актив",
                "Покупка ценных бумаг на заемные средства",
                "Перевод денег в иностранную валюту",
            ),
            listOf(
                "20%",
                "50%",
                "5%",
                "80%",
            ),
            listOf(
                "Кредитные карты",
                "Финансовые приложения",
                "Электронные таблицы",
                "Конвертовый метод",
            ),
            listOf(
                "Рост цен и снижение покупательной способности денег",
                "Падение цен на товары",
                "Уменьшение банковских процентов",
                "Увеличение производства товаров",
            ),
            listOf(
                "Финансовая подушка безопасности",
                "Пенсионные накопления",
                "Инвестиционный портфель",
                "Диверсификационный фонд",
            ),
            listOf(
                "Облигации",
                "Акции",
                "Криптовалюта",
                "Венчурные инвестиции",
            ),
            listOf(
                "Государство объявляет о банкротстве",
                "Акции компаний растут",
                "Курс валюты повышается",
                "Все кредиты списываются",
            ),
            listOf(
                "Расчетный счет",
                "Депозит",
                "Кредит",
                "Ипотека",
            ),
            listOf(
                "Открыть несколько источников дохода",
                "Работать больше часов",
                "Избегать расходов",
                "Перестать платить налоги",
            )
        )
    ),
    // 2
    DataQuiz(
        title = "Деньги под контролем",
        time = 6,
        listQ = listOf(
            "Что является первым шагом в управлении доходами?",
            "Что поможет лучше контролировать личные финансы?",
            "Какой из этих методов помогает эффективно распределять доход?",
            "Какой самый безопасный способ увеличить доход?",
            "Что НЕ относится к пассивному доходу?",
            "Почему важно создавать финансовую подушку безопасности?",
            "Какая привычка поможет эффективно управлять доходами?",
            "Какой самый надежный способ защитить свои сбережения от инфляции?",
            "Почему важно откладывать часть дохода?",
            "Что поможет лучше контролировать спонтанные траты?"
        ),
        listA = listOf(
            listOf(
                "Составить и проанализировать бюджет",
                "Взять кредит на крупную покупку",
                "Уволиться и найти новую работу",
                "Потратить половину зарплаты на инвестиции",
            ),
            listOf(
                "Регулярное ведение учета доходов и расходов",
                "Использование кредитных карт без ограничений",
                "Хранение всех денег в наличных",
                "Откладывание денег только в конце месяца",
            ),
            listOf(
                "Метод 50/30/20 (50% – нужды, 30% – желания, 20% – сбережения)",
                "Правило 70/30 (70% на развлечения, 30% на нужды)",
                "Тратить все деньги на основные нужды",
                "Хранить все средства на одном счету",
            ),
            listOf(
                "Начать откладывать деньги и инвестировать часть накоплений",
                "Взять кредит на новый бизнес без опыта",
                "Найти подработку, не учитывая нагрузку на основную работу",
                "Уволиться и заняться фрилансом без плана",
            ),
            listOf(
                "Разовые подработки",
                "Проценты по вкладу",
                "Доход от аренды недвижимости",
                "Дивиденды от акций",
            ),
            listOf(
                "Для защиты от неожиданных расходов и кризисов",
                "Чтобы была возможность беззаботно тратить деньги",
                "Чтобы можно было жить без работы годами",
                "Чтобы избежать уплаты налогов",
            ),
            listOf(
                "Регулярно анализировать свои финансы",
                "Тратить деньги сразу после зарплаты",
                "Брать кредиты на любые крупные покупки",
                "Покупать дорогие вещи в рассрочку",
            ),
            listOf(
                "Диверсифицировать активы и инвестировать часть средств",
                "Держать деньги в наличных",
                "Перевести все средства в криптовалюту",
                "Хранить деньги только на дебетовой карте",
            ),
            listOf(
                "Чтобы создать финансовую безопасность и новые возможности",
                "Чтобы накопить на мечту",
                "Чтобы потратить все в конце года",
                "Чтобы избежать использования банковских услуг",
            ),
            listOf(
                "Четкий лимит расходов и планирование бюджета",
                "Использование кэшбэков и скидок",
                "Покупки по акции в больших объемах",
                "Использование кредитных карт для покупок",
            )
        )
    ),
    // 3
    DataQuiz(
        title = "Первые шаги",
        time = 7,
        listQ = listOf(
            "Что такое инвестиции?",
            "Какой принцип помогает снизить риски при инвестировании?",
            "Что такое дивиденды?",
            "Какой вид инвестиций считается наименее рискованным?",
            "Что обозначает термин \"ликвидность\"?",
            "В чем преимущество долгосрочного инвестирования?",
            "Как называется инвестиция в стартапы с высоким риском?",
            "Что произойдет, если инвестор не диверсифицирует портфель?",
            "Как называется стратегия покупки активов при снижении их стоимости?",
            "Какой фактор наиболее влияет на доходность инвестиций?"
        ),
        listA = listOf(
            listOf(
                "Вложение денег с целью получения прибыли",
                "Покупка товаров в кредит",
                "Откладывание денег под подушку",
                "Оплата ежемесячных счетов",
            ),
            listOf(
                "Диверсифицировать вложения",
                "Вкладывать все деньги в один актив",
                "Держать деньги только в наличных",
                "Покупать только быстрорастущие активы",
            ),
            listOf(
                "Выплаты компании своим акционерам из прибыли",
                "Разница между покупкой и продажей акций",
                "Доход от сдачи недвижимости в аренду",
                "Налог на доход с инвестиций",
            ),
            listOf(
                "Государственные облигации",
                "Криптовалюта",
                "Акции технологических стартапов",
                "Венчурные фонды",
            ),
            listOf(
                "Способность актива быстро превращаться в деньги без потерь",
                "Размер прибыли от инвестиций",
                "Количество акций в портфеле",
                "Рост инфляции",
            ),
            listOf(
                "Возможность минимизировать краткосрочные рыночные колебания",
                "Возможность быстро заработать за несколько дней",
                "Гарантия стабильной прибыли каждый месяц",
                "Отсутствие налогов на прибыль",
            ),
            listOf(
                "Венчурные инвестиции",
                "Депозиты",
                "Облигации",
                "Дивиденды",
            ),
            listOf(
                "Увеличится риск потерь",
                "Снизится доходность",
                "Сбережения будут защищены от инфляции",
                "Портфель станет менее волатильным",
            ),
            listOf(
                "Усреднение стоимости",
                "Дампинг",
                "Кредитное плечо",
                "Долговая спираль",
            ),
            listOf(
                "Время, на которое сделаны вложения",
                "Количество денег на счету",
                "Размер ежемесячных затрат",
                "Частота проверки котировок",
            )
        )
    ),
    // 4
    DataQuiz(
        title = "Финансовая свобода",
        time = 8,
        listQ = listOf(
            "Что означает финансовая свобода?",
            "Какой главный шаг к финансовой независимости?",
            "Что помогает быстрее достичь финансовой свободы?",
            "Какой из этих источников дохода считается пассивным?",
            "Что НЕ является препятствием на пути к финансовой свободе?",
            "Какой подход к расходам приближает к финансовой свободе?",
            "Какой из этих факторов увеличивает шансы достичь финансовой свободы?",
            "Что делает человека финансово независимым?",
            "Что поможет быстрее выйти на пассивный доход?",
            "Как можно определить, что человек достиг финансовой свободы?"
        ),
        listA = listOf(
            listOf(
                "Возможность жить без необходимости работать",
                "Отсутствие долгов",
                "Получение высокой зарплаты",
                "Возможность тратить деньги без ограничений",
            ),
            listOf(
                "Создание пассивного дохода",
                "Увеличение расходов",
                "Использование кредитных карт",
                "Хранение всех денег в банке",
            ),
            listOf(
                "Откладывать деньги и инвестировать их",
                "Работать больше часов",
                "Тратить все деньги на качественную жизнь",
                "Полностью отказаться от любых покупок",
            ),
            listOf(
                "Доход от аренды недвижимости",
                "Заработная плата",
                "Гонорары за фриланс",
                "Бонусы от работодателя",
            ),
            listOf(
                "Диверсификация источников дохода",
                "Отсутствие финансовой дисциплины",
                "Высокая инфляция",
                "Импульсивные траты",
            ),
            listOf(
                "Контроль расходов и разумное инвестирование",
                "Покупка только самых дешевых товаров",
                "Игнорирование бюджета",
                "Хранение всех денег в наличных",
            ),
            listOf(
                "Умение откладывать часть дохода",
                "Частая смена работы",
                "Использование потребительских кредитов",
                "Регулярные спонтанные покупки",
            ),
            listOf(
                "Способность обеспечивать себя без активной работы",
                "Высокий уровень заработной платы",
                "Большое количество сбережений",
                "Работа в престижной компании",
            ),
            listOf(
                "Инвестирование в разные активы",
                "Работа без выходных",
                "Хранение денег в сейфе",
                "Получение зарплаты в иностранной валюте",
            ),
            listOf(
                "Он больше не нуждается в активной работе",
                "Он не берет кредиты",
                "Он зарабатывает больше, чем тратит",
                "У него есть крупный банковский вклад",
            )
        )
    ),
    // 5
    DataQuiz(
        title = "Деньги работают на тебя",
        time = 9,
        listQ = listOf(
            "Что означает \"заставить деньги работать\"?",
            "Какой самый простой способ заставить деньги приносить доход?",
            "Почему важно инвестировать, а не просто копить?",
            "Какой из этих инструментов приносит пассивный доход?",
            "Как называется процесс распределения вложений между разными активами?",
            "Какой инвестиционный инструмент считается наименее рискованным?",
            "Как можно получать доход от акций компании?",
            "Какой главный принцип работы сложного процента?",
            "Какой из вариантов не поможет заставить деньги работать?",
            "Почему важно реинвестировать прибыль?"
        ),
        listA = listOf(
            listOf(
                "Вкладывать деньги в активы, приносящие доход",
                "Держать деньги на дебетовой карте",
                "Тратить меньше, чем зарабатываешь",
                "Хранить все деньги в сейфе",
            ),
            listOf(
                "Разместить средства на банковском депозите",
                "Вложить в высокодоходные акции без анализа",
                "Держать деньги в кошельке",
                "Периодически менять валюту",
            ),
            listOf(
                "Деньги не обесцениваются из-за инфляции",
                "Можно быстро разбогатеть",
                "Копить слишком сложно",
                "Банки платят большие проценты по вкладам",
            ),
            listOf(
                "Аренда недвижимости",
                "Зарплата",
                "Бонусы от работодателя",
                "Долгосрочный кредит",
            ),
            listOf(
                "Диверсификация",
                "Монополизация",
                "Амортизация",
                "Спекуляция",
            ),
            listOf(
                "Государственные облигации",
                "Криптовалюта",
                "Венчурные стартапы",
                "Покупка акций одной компании",
            ),
            listOf(
                "Получать дивиденды или продавать акции дороже",
                "Покупать акции и держать их вечно",
                "Продавать акции дешевле, чем покупал",
                "Просто владеть ими без продажи",
            ),
            listOf(
                "Начисленные проценты добавляются к сумме вклада, и проценты начисляются на проценты",
                "Деньги умножаются только за счет первоначального вклада",
                "Чем больше снимаешь, тем больше зарабатываешь",
                "Проценты начисляются только один раз в год",
            ),
            listOf(
                "Хранение денег в стеклянной банке",
                "Регулярное инвестирование",
                "Покупка активов",
                "Создание пассивного дохода",
            ),
            listOf(
                "Чтобы деньги не простаивали и приносили больше дохода",
                "Чтобы быстрее потратить заработанное",
                "Чтобы избежать налогов",
                "Чтобы увеличить расходы",
            )
        )
    ),
)